[
  {
    "title": "NCSC-2025-0139 [1.00] [M/H] Kwetsbaarheid verholpen in SonicWall SonicOS",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0139",
    "description": "SonicWall heeft een kwetsbaarheid verholpen in SonicOS.\nDe kwetsbaarheid bevindt zich in de wijze waarop de SSLVPN Virtual Office interface van SonicOS functioneert. Een ongeauthenticeerde kwaadwillende kan deze kwetsbaarheid misbruiken, wat kan leiden tot een crash van de firewall. Dit kan resulteren in een Denial-of-Service (DoS) situatie, wat de beschikbaarheid van de getroffen diensten ernstig beïnvloedt.\n",
    "guid": "NCSC-2025-0139 [1.00]",
    "pubDate": "Fri, 25 Apr 2025 11:35:24 +0200"
  },
  {
    "title": "NCSC-2025-0138 [1.00] [M/H] Kwetsbaarheid verholpen in Commvault Command Center",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0138",
    "description": "Commvault heeft een kwetsbaarheid verholpen in Command Center. De kwetsbaarheid kan door een ongeauthenticeerde kwaadwillende op afstand worden misbruikt voor het uitvoeren van willekeurige code. Hiertoe dient een speciaal vervaardigd http-verzoek naar de kwetsbare applicatie te worden verstuurd met daarin een verwijzing naar een malafide zip-bestand. De kwetsbare applicatie downloadt vervolgens dit zip-bestand en pakt de bestanden die daarin staan uit. Op die manier kan de kwaadwillende via bijvoorbeeld een webshell code op het kwetsbare systeem uitvoeren.\n",
    "guid": "NCSC-2025-0138 [1.00]",
    "pubDate": "Thu, 24 Apr 2025 15:09:08 +0200"
  },
  {
    "title": "NCSC-2025-0137 [1.00] [M/H] Kwetsbaarheid verholpen in Erlang/OTP SSH-server",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0137",
    "description": "De ontwikkelaars van Erlang/OTP hebben een kwetsbaarheid verholpen in Erlang OTP. De kwetsbaarheid bevindt zich in de SSH-functionaliteit van de getroffen versies van Erlang/OTP. De kwetsbaarheid stelt een ongeauthenticeerde kwaadwillende op afstand in staat om willekeurige code uit te voeren in context van de SSH deamon, door geprepareerde verzoeken naar het kwetsbare systeem te versturen.\n",
    "guid": "NCSC-2025-0137 [1.00]",
    "pubDate": "Fri, 18 Apr 2025 07:33:40 +0200"
  },
  {
    "title": "NCSC-2025-0136 [1.00] [M/H] Kwetsbaarheden verholpen in Apple macOS, iOS en iPadOS",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0136",
    "description": "Apple heeft kwetsbaarheden verholpen in macOS, iOS en iPadOS. Een kwaadwillende kan de kwetsbaarheden misbruiken om willekeurige code uit te voeren met rechten van de gebruiker en zo mogelijk toegang krijgen tot gevoelige gegevens. Apple meldt informatie te hebben dat de kwetsbaarheden beperkt en zeer gericht zijn misbruikt op iOS.\n",
    "guid": "NCSC-2025-0136 [1.00]",
    "pubDate": "Thu, 17 Apr 2025 09:19:14 +0200"
  },
  {
    "title": "NCSC-2025-0135 [1.00] [M/H] Kwetsbaarheden verholpen in Siemens TeleControl Server",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0135",
    "description": "Siemens heeft kwetsbaarheden verholpen in TeleControl Server Basic. De kwetsbaarheden bevinden zich in de wijze waarop de TeleControl Server Basic SQL-injectie toestaat via verschillende methoden, zoals 'CreateTrace', 'VerifyUser', 'Authenticate', en vele anderen. Deze kwetsbaarheden stellen ongeauthenticeerde en geauthenticeerde kwaadwillenden in staat om toegang te krijgen tot de database en code uit te voeren met 'NT AUTHORITY\\NetworkService' rechten, mits zij toegang hebben tot poort 8000. Dit kan leiden tot ongeautoriseerde toegang en manipulatie van gegevens. Voor succesvol misbruik moet de kwaadwillende toegang hebben tot de productieomgeving. Het is goed gebruik een dergelijke omgeving niet publiek toegankelijk te hebben.\n",
    "guid": "NCSC-2025-0135 [1.00]",
    "pubDate": "Thu, 17 Apr 2025 09:14:24 +0200"
  },
  {
    "title": "NCSC-2025-0134 [1.00] [M/H] Kwetsbaarheid verholpen in Cisco Webex App",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0134",
    "description": "Cisco heeft een kwetsbaarheid verholpen in de Cisco Webex App. De kwetsbaarheid bevindt zich in de manier waarop de Cisco Webex App omgaat met zijn aangepaste URL-parser. Ongeauthenticeerde externe kwaadwillenden kunnen deze kwetsbaarheid misbruiken om gebruikers te misleiden tot het downloaden van willekeurige bestanden, wat kan leiden tot ongeautoriseerde commando-uitvoering op het systeem van de gebruiker. De oorzaak van deze kwetsbaarheid is onvoldoende invoervalidatie binnen de applicatie.\n",
    "guid": "NCSC-2025-0134 [1.00]",
    "pubDate": "Thu, 17 Apr 2025 09:11:41 +0200"
  },
  {
    "title": "NCSC-2025-0133 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle PeopleSoft",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0133",
    "description": "Oracle heeft kwetsbaarheden verholpen in Oracle PeopleSoft's Enterprise PeopleTools (versies 8.60, 8.61 en 8.62), Talent Acquisition Manager (versie 9.2) en Enterprise CC Common Application Objects (versie 9.2). De kwetsbaarheden in Oracle PeopleSoft's Enterprise PeopleTools, Talent Acquisition Manager en Enterprise CC Common Application Objects stellen laaggeprivilegieerde kwaadwillenden in staat om ongeautoriseerde toegang te verkrijgen en gevoelige gegevens te wijzigen. Ongeauthenticeerde kwaadwillenden kunnen een andere kwetsbaarheid misbruiken om volledige DoS te veroorzaken.\n",
    "guid": "NCSC-2025-0133 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 17:13:33 +0200"
  },
  {
    "title": "NCSC-2025-0132 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle MySQL",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0132",
    "description": "Oracle heeft meerdere kwetsbaarheden verholpen in MySQL\nDe kwetsbaarheden in Oracle MySQL stellen kwaadwillenden in staat om een denial-of-service-aanval uit te voeren, toegang te krijgen tot gevoelige gegevens of, met voldoende authorisaties de werking van de MySQL server te beinvloeden.\n",
    "guid": "NCSC-2025-0132 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 17:11:43 +0200"
  },
  {
    "title": "NCSC-2025-0131 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle JD Edwards",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0131",
    "description": "Oracle heeft kwetsbaarheden verholpen in JD Edwards EnterpriseOne Tools (Specifiek voor versies 9.2.0.0 tot 9.2.9.2). De kwetsbaarheden in JD Edwards EnterpriseOne Tools stellen ongeauthenticeerde kwaadwillenden in staat om via HTTP toegang te krijgen tot het systeem, wat kan leiden tot ongeautoriseerde toegang tot gevoelige gegevens en manipulatie daarvan of zelfs volledige overname van JD Edwards EnterpriseOne Tools. Enkele van de kwetsbaarheden kunnen leiden tot gedeeltelijke of volledige DoS, hiervoor is echter wel gebruikersinteractie vereist.\n",
    "guid": "NCSC-2025-0131 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 17:10:06 +0200"
  },
  {
    "title": "NCSC-2025-0130 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle Java",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0130",
    "description": "Oracle heeft kwetsbaarheden verholpen in Oracle Java SE en GraalVM (Specifiek voor versies 17.0.14, 21.0.6, 21.0.6 en 24). De kwetsbaarheden in Oracle Java SE en GraalVM stellen ongeauthenticeerde kwaadwillenden met netwerktoegang in staat om kritieke gegevens te manipuleren of te benaderen. Dit kan leiden tot ongeautoriseerde toegang tot gegevens, vooral via API's en in omgevingen die onbetrouwbare code uitvoeren. De kwetsbaarheid in de GStreamer-bibliotheek kan ook leiden tot geheugenproblemen en mogelijk willekeurige code-executie door beschadigde pointers.\n",
    "guid": "NCSC-2025-0130 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 17:04:40 +0200"
  },
  {
    "title": "NCSC-2025-0129 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle Analytics",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0129",
    "description": "Oracle heeft kwetsbaarheden verholpen in Oracle Analytics. De kwetsbaarheden stellen ongeauthenticeerde kwaadwillenden in staat om toegang te krijgen tot gevoelige gegevens, Denial-of-Service aan te richten, en zelfs volledige controle over systemen te verkrijgen. Specifieke kwetsbaarheden in Oracle Business Intelligence Enterprise Edition kunnen leiden tot ongeautoriseerde toegang en manipulatie van gegevens via HTTP. Daarnaast zijn er kwetsbaarheden die Denial-of-Service kunnen veroorzaken door onjuiste invoer of misbruik van systeemfunctionaliteiten.\n",
    "guid": "NCSC-2025-0129 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 17:02:22 +0200"
  },
  {
    "title": "NCSC-2025-0128 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle Fusion Middleware",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0128",
    "description": "Oracle heeft meerdere kwetsbaarheden verholpen in verschillende producten, waaronder de Utilities Application Framework, WebLogic Server, en Fusion Middleware. De kwetsbaarheden stellen ongeauthenticeerde kwaadwillenden in staat om toegang te krijgen tot kritieke gegevens, Denial-of-Service (DoS) te veroorzaken, en in sommige gevallen zelfs volledige controle over systemen te verkrijgen. Kwaadwillenden kunnen deze kwetsbaarheden misbruiken door speciaal vervaardigde verzoeken te sturen of door gebruik te maken van onveilige configuraties in de getroffen producten.\n",
    "guid": "NCSC-2025-0128 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 17:01:24 +0200"
  },
  {
    "title": "NCSC-2025-0127 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle Financial Services",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0127",
    "description": "Oracle heeft kwetsbaarheden verholpen in verschillende Financial Services producten De kwetsbaarheden stellen niet-geauthenticeerde kwaadwillenden in staat om via HTTP toegang te krijgen tot kritieke gegevens, wat kan leiden tot ongeautoriseerde gegevenstoegang en andere beveiligingsrisico's. Kwaadwillenden kunnen ook gebruik maken van misconfiguraties en kwetsbaarheden in de software om privilege-escalatie, denial-of-service en remote code execution uit te voeren.\n",
    "guid": "NCSC-2025-0127 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 17:00:12 +0200"
  },
  {
    "title": "NCSC-2025-0126 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle Enterprise Manager",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0126",
    "description": "Oracle heeft kwetsbaarheden verholpen in Oracle Enterprise Manager De kwetsbaarheden stellen ongeauthenticeerde aanvallers in staat om systemen te compromitteren via HTTP of SSH, wat kan leiden tot Denial-of-Service (DoS) of vertrouwelijke informatie openbaarmaking. Specifiek in de ObjectSerializationDecoder van Apache MINA is er een kritieke kwetsbaarheid die op afstand code-executie mogelijk maakt door een gebrek aan beveiligingscontroles in het deserialisatieproces. Dit betreft versies 2.0.X, 2.1.X, en 2.2.X. Daarnaast kunnen aanvallers ook gebruik maken van een kwetsbaarheid in Oracle's Primavera Gateway, die een Denial-of-Service kan veroorzaken.\n",
    "guid": "NCSC-2025-0126 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 16:59:13 +0200"
  },
  {
    "title": "NCSC-2025-0125 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle E-Business Suite",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0125",
    "description": "Oracle heeft kwetsbaarheden verholpen in Oracle E-Business Suite (Specifiek voor versies 12.2.3 tot 12.2.14). De kwetsbaarheden bevinden zich in verschillende componenten van de Oracle E-Business Suite, waaronder de Enterprise Command Center Framework, CRM Technical Foundation, iSupplier Portal, iStore, User Management, Applications Framework, CRM User Management Framework, Teleservice, Configurator, Application Object Library, en Scripting. Deze kwetsbaarheden stellen ongeauthenticeerde aanvallers in staat om toegang te krijgen tot gevoelige gegevens, wat kan leiden tot ongeautoriseerde toegang, gegevenswijzigingen en zelfs gedeeltelijke denial-of-service.\n",
    "guid": "NCSC-2025-0125 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 16:58:05 +0200"
  },
  {
    "title": "NCSC-2025-0124 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle Communications",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0124",
    "description": "Oracle heeft meerdere kwetsbaarheden verholpen in Oracle Communications producten, waaronder de Cloud Native Core en Policy Management. De kwetsbaarheden in Oracle Communications producten stellen ongeauthenticeerde aanvallers in staat om ongeautoriseerde toegang te verkrijgen tot gevoelige gegevens en kunnen leiden tot Denial-of-Service (DoS) aanvallen. Specifieke versies van de Cloud Native Core, zoals de Binding Support Function en Network Repository Function, zijn getroffen, met CVSS-scores die variëren van 4.3 tot 9.8, wat wijst op significante risico's voor de beschikbaarheid en vertrouwelijkheid van de systemen.\n",
    "guid": "NCSC-2025-0124 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 10:39:55 +0200"
  },
  {
    "title": "NCSC-2025-0123 [1.00] [M/H] Kwetsbaarheden verholpen in Oracle Database Producten",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0123",
    "description": "Oracle heeft kwetsbaarheden verholpen in diverse Oracle Database Producten en subsystemen, zoals Oracle Server, NoSQL, TimesTen, Secure Backup en Essbase. De kwetsbaarheden stellen ongeauthenticeerde kwaadwillenden in staat om een Denial-of-Service te veroorzaken of om ongeautoriseerde toegang te verkrijgen tot gevoelige gegevens en gegevens te manipuleren. Subcomponenten als de RDBMS Listener, Java VM, en andere componenten zijn specifiek kwetsbaar, met CVSS-scores variërend van 5.3 tot 7.5, wat duidt op een gematigd tot hoog risico.\n",
    "guid": "NCSC-2025-0123 [1.00]",
    "pubDate": "Wed, 16 Apr 2025 10:37:39 +0200"
  },
  {
    "title": "NCSC-2025-0122 [1.00] [M/H] Kwetsbaarheden verholpen in Rockwell Automation Arena",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0122",
    "description": "Rockwell Automation heeft kwetsbaarheden verholpen in Arena. De kwetsbaarheden in Rockwell Automation Arena zijn gerelateerd aan lokale code-executie, veroorzaakt door onjuiste validatie van door de gebruiker aangeleverde gegevens. Dit stelt kwaadwillenden in staat om gevoelige informatie te onthullen en willekeurige code uit te voeren wanneer een legitieme gebruiker een kwaadaardig DOE-bestand opent. De exploitatie van deze kwetsbaarheden kan leiden tot significante beveiligingsrisico's, waaronder informatie openbaarmaking en ongeoorloofde code-executie.\n",
    "guid": "NCSC-2025-0122 [1.00]",
    "pubDate": "Mon, 14 Apr 2025 13:29:22 +0200"
  },
  {
    "title": "NCSC-2025-0121 [1.00] [M/H] Kwetsbaarheid verholpen in Gladinet CentreStack",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0121",
    "description": "Gladinet heeft een kwetsbaarheid verholpen in CentreStack (Versies tot 16.1.10296.56315). De kwetsbaarheid bevindt zich in de manier waarop hardcoded machineKeys en cryptografische sleutels worden gebruikt, hetgeen resulteert in een ernstige deserialisatiekwetsbaarheid. De kwetsbaarheid maakt het voor een kwaadwillende mogelijk om malafide ViewState-payloads te genereren die door het getroffen systeem als geldig worden geaccepteerd. Hierdoor kan willekeurige code op afstand worden uitgevoerd binnen de context van het kwetsbare systeem. Gladinet geeft aan dat de kwetsbaarheid sinds maart 2025 actief wordt misbruikt. Ook het Amerikaanse Cybersecurity and Infrastructure Security Agency (CISA) meldt via de Known Exploited Vulnerability Database dat de kwetsbaarheid is misbruikt.\n",
    "guid": "NCSC-2025-0121 [1.00]",
    "pubDate": "Thu, 10 Apr 2025 13:53:42 +0200"
  },
  {
    "title": "NCSC-2025-0120 [1.00] [M/H] Kwetsbaarheden verholpen in Ivanti Endpoint Manager",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0120",
    "description": "Ivanti heeft kwetsbaarheden verholpen in Ivanti Endpoint Manager (Specifiek voor versies vóór 2024 SU1 en 2022 SU7). Een aanvaller kan misbruik maken van meerdere kwetsbaarheden in Ivanti Endpoint Manager om rechten te verhogen, cross-site scripting-aanvallen uit te voeren, willekeurige code uit te voeren, gegevens te manipuleren en een denial-of-service-situatie te veroorzaken.\n",
    "guid": "NCSC-2025-0120 [1.00]",
    "pubDate": "Wed, 09 Apr 2025 16:41:41 +0200"
  },
  {
    "title": "NCSC-2025-0119 [1.00] [M/H] Kwetsbaarheden verholpen in SAP-producten",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0119",
    "description": "SAP heeft kwetsbaarheden verholpen in verschillende producten, waaronder SAP Financial Consolidation, SAP Landscape Transformation, SAP NetWeaver Application Server ABAP, SAP Commerce Cloud, SAP ERP BW, SAP BusinessObjects Business Intelligence Platform, SAP KMC WPC, SAP Solution Manager, SAP S4CORE, en SAP CRM. De uitgebrachte paches bevatten een aantal kritieke kwetsbaarheden met de kenmerken CVE-2025-30016, CVE-2025-31330 en CVE-2025-27429. De kwetsbaarheid met kenmerk CVE-2025-30016 is een kritieke authenticatie-bypass in SAP Financial Consolidation, die ongeauthenticeerde aanvallers toegang geeft tot het Admin-account.  SAP Landscape Transformation heeft een kwetsbaarheid met kenmerk CVE-2025-31330, die het mogelijk maakt voor aanvallers met gebruikersprivileges om willekeurige ABAP-code in te voegen. De kwetsbaarheid met kenmerk CVE-2025-27429 in SAP S/4HANA (Private Cloud) stelt een aanvaller met gebruikersprivileges in staat om willekeurige ABAP-code in de RFC-functiemodule te injecteren en autorisatiecontroles te omzeilen, waardoor de vertrouwelijkheid, integriteit en beschikbaarheid van het systeem in gevaar komen. SAP NetWeaver Application Server ABAP heeft een Mixed Dynamic RFC Destination-kwetsbaarheid die kan leiden tot blootstelling van gevoelige inloggegevens. Daarnaast zijn er kwetsbaarheden in SAP Commerce Cloud die de vertrouwelijkheid en integriteit van gegevens in gevaar kunnen brengen. De kwetsbaarheden in SAP ERP BW en SAP BusinessObjects kunnen leiden tot ongeautoriseerde uitvoering van commando's en wijziging van bestanden. De directory traversal-kwetsbaarheden in SAP Capital Yield Tax Management en SAP Solution Manager stellen aanvallers in staat om gevoelige informatie te verkrijgen. De SSRF-kwetsbaarheid in SAP CRM en SAP S/4HANA kan de vertrouwelijkheid van interne netwerkbronnen in gevaar brengen.\n",
    "guid": "NCSC-2025-0119 [1.00]",
    "pubDate": "Wed, 09 Apr 2025 11:12:05 +0200"
  },
  {
    "title": "NCSC-2025-0118 [1.00] [M/H] Kwetsbaarheden verholpen in Adobe Framemaker",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0118",
    "description": "Adobe heeft kwetsbaarheden verholpen in Adobe Framemaker (Specifiek voor versies 2020.7, 2022.5 en eerder). De kwetsbaarheden omvatten onder andere een Heap-based Buffer Overflow, Stack-based Buffer Overflow, Integer Underflow, NULL Pointer Dereference en een out-of-bounds read. Deze kwetsbaarheden kunnen leiden tot ongeautoriseerde code-executie, het potentieel onthullen van gevoelige geheugeninformatie en denial-of-service. De kwetsbaarheden worden misbruikt wanneer een gebruiker een speciaal vervaardigd kwaadaardig bestand opent.\n",
    "guid": "NCSC-2025-0118 [1.00]",
    "pubDate": "Wed, 09 Apr 2025 10:14:16 +0200"
  },
  {
    "title": "NCSC-2025-0117 [1.00] [M/H] Kwetsbaarheden verholpen in Adobe Animate",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0117",
    "description": "Adobe heeft kwetsbaarheden verholpen in Animate versies 24.0.7, 23.0.10 en eerder. De kwetsbaarheden omvatten een Heap-based Buffer Overflow, een Use After Free en twee out-of-bounds read kwetsbaarheden. Deze kwetsbaarheden kunnen leiden tot willekeurige code-executie in de context van de gebruiker en het potentieel onthullen van gevoelige geheugeninformatie. Wel is gebruikersinteractie nodig voor het openen van een kwaadaardig bestand.\n",
    "guid": "NCSC-2025-0117 [1.00]",
    "pubDate": "Wed, 09 Apr 2025 10:12:45 +0200"
  },
  {
    "title": "NCSC-2025-0116 [1.00] [M/H] Kwetsbaarheid verholpen in Adobe Photoshop",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0116",
    "description": "Adobe heeft een kwetsbaarheid verholpen in Photoshop Desktop (Specifiek voor versies 25.12.1, 26.4.1 en eerder). De kwetsbaarheid bevindt zich in de wijze waarop Photoshop Desktop omgaat met bestanden. Een kwaadwillende kan deze kwetsbaarheid misbruiken door een kwaadaardig bestand te creëren dat, wanneer geopend door de gebruiker, kan leiden tot willekeurige code-uitvoering. Dit kan resulteren in ongeautoriseerde toegang en controle over het getroffen systeem.\n",
    "guid": "NCSC-2025-0116 [1.00]",
    "pubDate": "Wed, 09 Apr 2025 10:09:40 +0200"
  },
  {
    "title": "NCSC-2025-0115 [1.00] [M/H] Kwetsbaarheden verholpen in Adobe ColdFusion",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0115",
    "description": "Adobe heeft kwetsbaarheden verholpen in ColdFusion (Specifiek voor versies 2023.12, 2021.18, 2025.0 en eerder). De kwetsbaarheden bevinden zich in de manier waarop ColdFusion omgaat met invoervalidatie, authenticatie, toegang en deserialisatie van onbetrouwbare gegevens. Kwaadwillenden kunnen deze kwetsbaarheden misbruiken om willekeurige code uit te voeren, ongeautoriseerde toegang te verkrijgen, en gevoelige gegevens te lezen of te wijzigen. De meeste kwetsbaarheden vereisen gebruikersinteractie, zoals het openen van een kwaadaardig bestand of het bezoeken van een gecompromitteerde URL.\n",
    "guid": "NCSC-2025-0115 [1.00]",
    "pubDate": "Wed, 09 Apr 2025 10:08:15 +0200"
  },
  {
    "title": "NCSC-2025-0114 [1.00] [M/H] Kwetsbaarheden verholpen in Adobe After Effects",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0114",
    "description": "Adobe heeft kwetsbaarheden verholpen in Adobe After Effects (Specifiek voor versies 25.1, 24.6.4, en eerder). De kwetsbaarheden omvatten kwetsbaarheden voor willekeurige code-executie, out-of-bounds read en een NULL Pointer Dereference. Aanvallers kunnen deze kwetsbaarheden misbruiken door een speciaal vervaardigd kwaadaardig bestand te openen, wat kan leiden tot ongeautoriseerde code-executie in context van de gebruiker, onthulling van gevoelige geheugeninformatie, of een denial-of-service scenario.\n",
    "guid": "NCSC-2025-0114 [1.00]",
    "pubDate": "Wed, 09 Apr 2025 10:05:51 +0200"
  },
  {
    "title": "NCSC-2025-0113 [1.00] [M/H] Kwetsbaarheid verholpen in FortiSwitch",
    "link": "https://advisories.ncsc.nl/advisory?id=NCSC-2025-0113",
    "description": "Fortinet heeft een kwetsbaarheid verholpen in de FortiSwitch GUI. De kwetsbaarheid met kenmerk CVE-2024-48887,  bevindt zich in de FortiSwitch GUI, waardoor een externe, niet-geauthenticeerde kwaadwllende in staat is om admin-wachtwoorden te wijzigen via speciaal vervaardigde verzoeken. Dit beveiligingsprobleem kan leiden tot ongeautoriseerde toegang en controle over de getroffen systemen.\n",
    "guid": "NCSC-2025-0113 [1.00]",
    "pubDate": "Wed, 09 Apr 2025 08:49:51 +0200"
  }
]